#pragma once

#include "Matrix.h"

#include <cmath>
#include <iostream>

/************************************/
/*     Матрица поправки времени     */
/************************************/

class TimeMatrix {
private:

/************************************/
/*      Приватные члены класса      */
/************************************/

    float S;        // Угол поправки времени
    Matrix3x3 Matrix;  // Матрица, которая будет содержать вычисленное значение матрицы астроизмерений

public:

/************************************/
/*          Работа с углом          */
/************************************/
    
    // Метод для установки значения угла
    void SetS(float S);

    // Метод для получения значения угла
    float GetS();

    // Метод для вывода значения приватных полей
    void PrintParameters() const;

/************************************/
/*          Работа с матрицей       */
/************************************/

    // Конструкторы
    TimeMatrix();   // Конструктор по умолчанию
    TimeMatrix(float S);    // Конструктор с параметрами

    // Метод для вычисления матрицы
    Matrix3x3 ComputeTimeMatrix();

    // Геттер для матрицы
    Matrix3x3 GetTimeMatrix();

    // Метод для вывода матрицы
    void PrintTimeMatrix() const;
};
